; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Description
;;; ------------
;;; A manipulator works in an environment in
;;; which...
;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain MANIPULATOR)
  (:requirements :strips :typing)
  (:types block				;This is the object that is supposed to be manipulated
	  door				;This can be opened or closed
	  location			;Location at which obstruction is safe
  )

  (:predicates (m-at ?l - location)
	       (b-at ?b - block ?l - location)
	       (d-at ?d - door ?l1 ?l2 - location)
	       (adjacent ?l1 ?l2 - location)
 	       (holding ?b - block)
	       (on ?b1 ?b2 - block)
	       (onground ?b - block)
	       (clear ?b - block)
	       (empty ?l - location)
	       (free-grippers)
  )

  (:action move
	     :parameters (?from ?to - location)
	     :precondition 
		(and (m-at ?from)
		(adjacent ?from ?to))
	     :effect
		(and (m-at ?to)
		(not(m-at ?from)))
  )


  (:action place
	     :parameters (?b - block ?l - location)
	     :precondition 
		(and (m-at ?l)
		(empty ?l)
		(holding ?b))
	     :effect
	        (and (free-grippers)
		(not(holding ?b))
		(b-at ?b ?l)
		(clear ?b)
		(not(empty ?l))
		(onground ?b))
  )


  (:action stack
	     :parameters (?btop ?bbottom - block ?l - location)
	     :precondition 
		(and (m-at ?l)
		(b-at ?bbottom ?l)
		(clear ?bbottom)
		(holding ?btop))
	     :effect
	        (and (free-grippers)
		(not(holding ?btop))
		(b-at ?btop ?l)
		(on ?btop ?bbottom)
		(not(clear ?bbottom))
		(clear ?btop))
  )


  (:action pickup
	     :parameters (?b - block ?l - location)
	     :precondition 
		(and (m-at ?l)
		(b-at ?b ?l)
		(onground ?b)
		(clear ?b)
		(free-grippers))
	     :effect
		(and (holding ?b)
		(not(b-at ?b ?l))
		(not(free-grippers))
		(not(onground ?b))
		(empty ?l)
		(not(clear ?b)))
  )

  (:action destack
	     :parameters (?btop ?bbottom - block ?l - location)
	     :precondition 
		(and (m-at ?l)
		(b-at ?btop ?l)
		(b-at ?bbottom ?l)
		(clear ?btop)
		(on ?btop ?bbottom)
		(free-grippers))
	     :effect
		(and (holding ?btop)
		(not(b-at ?btop ?l))
		(not(free-grippers))
		(not(on ?btop ?bbottom))
		(not(clear ?btop))
		(clear ?bbottom))
  )


  (:action open
	     :parameters (?d - door ?unlockable ?locked - location)
	     :precondition 
		(and (m-at ?unlockable)
		(d-at ?d ?unlockable ?locked)
		(free-grippers))
	     :effect
		(and (adjacent ?unlockable ?locked)
		(adjacent ?locked ?unlockable))
  )

)

; problem
(define (problem MANIPULATOR-1)

(:domain MANIPULATOR)
  (:objects
	D - door
	L1 L2 L3 L4 - location
	B1 B2 B3 B4 B5 B6 - block
  )

  (:init
	(m-at L1)
	(holding B4)
	(adjacent L1 L2)(adjacent L2 L1)
	(d-at D L2 L3)
	(adjacent L3 L4)(adjacent L4 L3)
	(b-at B1 L1)(b-at B2 L1)(b-at B3 L1)
	(onground B3)(on B2 B3)(on B1 B2)(clear B1)
	(b-at B6 L4)(b-at B5 L4)
	(onground B6)(on B5 B6)(clear B5)
	(empty L3)
  )

  (:goal 
	(and(b-at B3 L4)
	(on B2 B3))
  )
)

; plan
1. (stack b4 b1 l1)
   deleted: (holding b4) (clear b1)
   added: (free-grippers) (b-at b4 l1) (on b4 b1) (clear b4)
   goals met: 1 of 2
2. (move l1 l2)
   deleted: (m-at l1)
   added: (m-at l2)
   goals met: 1 of 2
3. (open d l2 l3)
   added: (adjacent l2 l3) (adjacent l3 l2)
   goals met: 1 of 2
4. (move l2 l1)
   deleted: (m-at l2)
   added: (m-at l1)
   goals met: 1 of 2
5. (destack b4 b1 l1)
   deleted: (b-at b4 l1) (free-grippers) (on b4 b1) (clear b4)
   added: (holding b4) (clear b1)
   goals met: 1 of 2
6. (move l1 l2)
   deleted: (m-at l1)
   added: (m-at l2)
   goals met: 1 of 2
7. (move l2 l3)
   deleted: (m-at l2)
   added: (m-at l3)
   goals met: 1 of 2
8. (place b4 l3)
   deleted: (holding b4) (empty l3)
   added: (free-grippers) (b-at b4 l3) (clear b4) (onground b4)
   goals met: 1 of 2
9. (move l3 l2)
   deleted: (m-at l3)
   added: (m-at l2)
   goals met: 1 of 2
10. (move l2 l1)
   deleted: (m-at l2)
   added: (m-at l1)
   goals met: 1 of 2
11. (destack b1 b2 l1)
   deleted: (b-at b1 l1) (free-grippers) (on b1 b2) (clear b1)
   added: (holding b1) (clear b2)
   goals met: 1 of 2
12. (move l1 l2)
   deleted: (m-at l1)
   added: (m-at l2)
   goals met: 1 of 2
13. (move l2 l3)
   deleted: (m-at l2)
   added: (m-at l3)
   goals met: 1 of 2
14. (stack b1 b4 l3)
   deleted: (holding b1) (clear b4)
   added: (free-grippers) (b-at b1 l3) (on b1 b4) (clear b1)
   goals met: 1 of 2
15. (move l3 l2)
   deleted: (m-at l3)
   added: (m-at l2)
   goals met: 1 of 2
16. (move l2 l1)
   deleted: (m-at l2)
   added: (m-at l1)
   goals met: 1 of 2
17. (destack b2 b3 l1)
   deleted: (b-at b2 l1) (free-grippers) (on b2 b3) (clear b2)
   added: (holding b2) (clear b3)
   goals met: 0 of 2
18. (move l1 l2)
   deleted: (m-at l1)
   added: (m-at l2)
   goals met: 0 of 2
19. (move l2 l3)
   deleted: (m-at l2)
   added: (m-at l3)
   goals met: 0 of 2
20. (stack b2 b1 l3)
   deleted: (holding b2) (clear b1)
   added: (free-grippers) (b-at b2 l3) (on b2 b1) (clear b2)
   goals met: 0 of 2
21. (move l3 l2)
   deleted: (m-at l3)
   added: (m-at l2)
   goals met: 0 of 2
22. (move l2 l1)
   deleted: (m-at l2)
   added: (m-at l1)
   goals met: 0 of 2
23. (pickup b3 l1)
   deleted: (b-at b3 l1) (free-grippers) (onground b3) (clear b3)
   added: (holding b3) (empty l1)
   goals met: 0 of 2
24. (move l1 l2)
   deleted: (m-at l1)
   added: (m-at l2)
   goals met: 0 of 2
25. (move l2 l3)
   deleted: (m-at l2)
   added: (m-at l3)
   goals met: 0 of 2
26. (move l3 l4)
   deleted: (m-at l3)
   added: (m-at l4)
   goals met: 0 of 2
27. (stack b3 b5 l4)
   deleted: (holding b3) (clear b5)
   added: (free-grippers) (b-at b3 l4) (on b3 b5) (clear b3)
   goals met: 1 of 2
28. (move l4 l3)
   deleted: (m-at l4)
   added: (m-at l3)
   goals met: 1 of 2
29. (destack b2 b1 l3)
   deleted: (b-at b2 l3) (free-grippers) (on b2 b1) (clear b2)
   added: (holding b2) (clear b1)
   goals met: 1 of 2
30. (move l3 l4)
   deleted: (m-at l3)
   added: (m-at l4)
   goals met: 1 of 2
31. (stack b2 b3 l4)
   deleted: (holding b2) (clear b3)
   added: (free-grippers) (b-at b2 l4) (on b2 b3) (clear b2)
   goals met: 2 of 2
